apache/nuttx/arch/arm/src/stm32wl5/stm32wl5_serial.c
  const uint8_t     irq;       /* IRQ associated with this USART */
  const uint32_t    apbclock;  /* PCLK 1 or 2 frequency */
  const uint32_t    usartbase; /* Base address of USART registers */
  const uint32_t    tx_gpio;   /* U[S]ART TX GPIO pin configuration */
  const uint32_t    rx_gpio;   /* U[S]ART RX GPIO pin configuration */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  const uint32_t    rts_gpio;  /* U[S]ART RTS GPIO pin configuration */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t    cts_gpio;  /* U[S]ART CTS GPIO pin configuration */
#endif

#ifdef SERIAL_HAVE_DMA
  const unsigned int rxdma_channel; /* DMA channel assigned */
#endif

  /* RX DMA state */

#ifdef SERIAL_HAVE_DMA
  DMA_HANDLE        rxdma;     /* currently-open receive DMA stream */
  bool              rxenable;  /* DMA-based reception en/disable */
#ifdef CONFIG_PM
  bool              rxdmasusp; /* Rx DMA suspended */
#endif
  uint32_t          rxdmanext; /* Next byte in the DMA buffer to be read */
  char       *const rxfifo;    /* Receive DMA buffer */
#endif

#ifdef HAVE_RS485
  const uint32_t    rs485_dir_gpio;     /* U[S]ART RS-485 DIR GPIO pin configuration */
  const bool        rs485_dir_polarity; /* U[S]ART RS-485 DIR pin state for TX enabled */
#endif
  spinlock_t        lock;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32wl5serial_setformat(struct uart_dev_s *dev);
#endif
static int  stm32wl5serial_setup(struct uart_dev_s *dev);
static void stm32wl5serial_shutdown(struct uart_dev_s *dev);
static int  stm32wl5serial_attach(struct uart_dev_s *dev);
static void stm32wl5serial_detach(struct uart_dev_s *dev);
static int  stm32wl5serial_interrupt(int irq, void *context,
                                     void *arg);
static int  stm32wl5serial_ioctl(struct file *filep, int cmd,
                                 unsigned long arg);
#ifndef SERIAL_HAVE_ONLY_DMA
static int  stm32wl5serial_receive(struct uart_dev_s *dev,
                                   unsigned int *status);
static void stm32wl5serial_rxint(struct uart_dev_s *dev, bool enable);
static bool stm32wl5serial_rxavailable(struct uart_dev_s *dev);
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool stm32wl5serial_rxflowcontrol(struct uart_dev_s *dev,
                                         unsigned int nbuffered, bool upper);
#endif
static void stm32wl5serial_send(struct uart_dev_s *dev, int ch);
static void stm32wl5serial_txint(struct uart_dev_s *dev, bool enable);
static bool stm32wl5serial_txready(struct uart_dev_s *dev);

#ifdef SERIAL_HAVE_DMA
static int  stm32wl5serial_dmasetup(struct uart_dev_s *dev);
static void stm32wl5serial_dmashutdown(struct uart_dev_s *dev);
static int  stm32wl5serial_dmareceive(struct uart_dev_s *dev,
                                      unsigned int *status);
static void stm32wl5serial_dmareenable(struct stm32_serial_s *priv);
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool stm32wl5serial_dmaiflowrestart(struct stm32_serial_s *priv);
#endif
static void stm32wl5serial_dmarxint(struct uart_dev_s *dev, bool enable);
static bool stm32wl5serial_dmarxavailable(struct uart_dev_s *dev);

static void stm32wl5serial_dmarxcallback(DMA_HANDLE handle, uint8_t status,
                                         void *arg);
#endif

#ifdef CONFIG_PM
static void stm32wl5serial_setsuspend(struct uart_dev_s *dev, bool suspend);
static void stm32wl5serial_pm_setsuspend(bool suspend);
static void stm32wl5serial_pmnotify(struct pm_callback_s *cb, int domain,
                                    enum pm_state_e pmstate);
static int  stm32wl5serial_pmprepare(struct pm_callback_s *cb,
                                     int domain,
                                     enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_DMA
static const struct uart_ops_s g_uart_ops =
{
  .setup          = stm32wl5serial_setup,
  .shutdown       = stm32wl5serial_shutdown,
  .attach         = stm32wl5serial_attach,
  .detach         = stm32wl5serial_detach,
  .ioctl          = stm32wl5serial_ioctl,
  .receive        = stm32wl5serial_receive,
  .rxint          = stm32wl5serial_rxint,
  .rxavailable    = stm32wl5serial_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = stm32wl5serial_rxflowcontrol,
#endif
  .send           = stm32wl5serial_send,
  .txint          = stm32wl5serial_txint,
  .txready        = stm32wl5serial_txready,
  .txempty        = stm32wl5serial_txready,
};
#endif

#ifdef SERIAL_HAVE_DMA
static const struct uart_ops_s g_uart_dma_ops =
{
  .setup          = stm32wl5serial_dmasetup,
  .shutdown       = stm32wl5serial_dmashutdown,
  .attach         = stm32wl5serial_attach,
  .detach         = stm32wl5serial_detach,
  .ioctl          = stm32wl5serial_ioctl,
  .receive        = stm32wl5serial_dmareceive,
  .rxint          = stm32wl5serial_dmarxint,
  .rxavailable    = stm32wl5serial_dmarxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = stm32wl5serial_rxflowcontrol,
#endif
  .send           = stm32wl5serial_send,
  .txint          = stm32wl5serial_txint,
  .txready        = stm32wl5serial_txready,
  .txempty        = stm32wl5serial_txready,
};
#endif

/* I/O buffers */

#ifdef CONFIG_STM32_LPUART1_SERIALDRIVER
static char g_lpuart1rxbuffer[CONFIG_LPUART1_RXBUFSIZE];
static char g_lpuart1txbuffer[CONFIG_LPUART1_TXBUFSIZE];
#  ifdef CONFIG_LPUART1_RXDMA
static char g_lpuart1rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_STM32_USART1_SERIALDRIVER
static char g_usart1rxbuffer[CONFIG_USART1_RXBUFSIZE];
static char g_usart1txbuffer[CONFIG_USART1_TXBUFSIZE];
#  ifdef CONFIG_USART1_RXDMA
static char g_usart1rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_STM32_USART2_SERIALDRIVER
static char g_usart2rxbuffer[CONFIG_USART2_RXBUFSIZE];
static char g_usart2txbuffer[CONFIG_USART2_TXBUFSIZE];
#  ifdef CONFIG_USART2_RXDMA
static char g_usart2rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

/* This describes the state of the STM32 USART1 ports. */

#ifdef CONFIG_STM32_LPUART1_SERIALDRIVER
static struct stm32_serial_s g_lpuart1priv =
{
  .dev =
    {
#  if CONSOLE_UART == 1
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_LPUART1_RXBUFSIZE,
        .buffer  = g_lpuart1rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_LPUART1_TXBUFSIZE,
        .buffer  = g_lpuart1txbuffer,
      },
#  ifdef CONFIG_LPUART1_RXDMA
      .ops       = &g_uart_dma_ops,
#  else
      .ops       = &g_uart_ops,
#  endif
      .priv      = &g_lpuart1priv,
    },

